Сегодня узнал о существовании библиотеки [Tracery](http://tracery.io/). В сущности, это компилятор очень простого макроязыка, который делает одну вещь: подставляет в строку в указанном месте случайное значение из заданного массива, причем рекурсивно. Например такая «грамматика»:
```json
{
    "encounter": ["Я встретил #animal"],
    "animal": ["серого волка", "#color# медведя", "#color# зайца"],
    "color": ["черного", "белого"]
}
```
будет выдавать встречу с серым волком либо черным/белым медведем/зайцем.
Есть порт на Ruby, Python, макрос для Twine и недавно появился на [C#](https://github.com/v21/unity-tracery).
